IDENTIFICATION DIVISION.
PROGRAM-ID. Pogg.
DATA DIVISION.
WORKING-STORAGE SECTION.
Tableau LINE 4, SIZE 55 FLOAT. #mi
@w!
CONST Thameur CHAR.
CONST Abi=(-4).
CONST Hadjer="13".
Eren | Mikasa | Armin STRING.
Reiner INTEGER.
PROCEDURE DIVISION.
Reiner=0.
Reiner=Hadjer+Armin/Reiner.
MOVE Thameur TO 31
IF ((Reiner*Eren.G.55+Pieck/0)):
MOVE Armin TO Eren
DISPLAY (“&”:Abi).
END
END
ACCEPT (“$”:@Abi).
END
STOP RUN